<h1>INSTACART MARKET BASKET ANALYSIS</h1>

<p>The Instacart Market Basket Analysis project aims to explore and analyze customer shopping behavior using transactional data from the Instacart platform. The different dataset utilized in this project provides a rich source of information that can be used to derive valuable insights for optimizing operations and enhancing customer experiences</p>

<h3>Import the necessary modules</h3>

In [1]:
import pandas as pd
import matplotlib as plt
import numpy as np
import sqlalchemy

<h3>Import the necessary datasets into pandas dataframe</h3>

In [2]:
aisles = pd.read_csv(r"C:\Users\f.akinsemoyin\Documents\DATA STUDY\SQL\HEXACART MARKET BASKET ANALYSIS\aisles.csv")
departments = pd.read_csv(r"C:\Users\f.akinsemoyin\Documents\DATA STUDY\SQL\HEXACART MARKET BASKET ANALYSIS\departments.csv")
orders = pd.read_csv(r"C:\Users\f.akinsemoyin\Documents\DATA STUDY\SQL\HEXACART MARKET BASKET ANALYSIS\orders.csv")
products = pd.read_csv(r"C:\Users\f.akinsemoyin\Documents\DATA STUDY\SQL\HEXACART MARKET BASKET ANALYSIS\products.csv")
order_products_prior = pd.read_csv(r"C:\Users\f.akinsemoyin\Documents\DATA STUDY\SQL\HEXACART MARKET BASKET ANALYSIS\order_products__prior.csv")
order_products_train = pd.read_csv(r"C:\Users\f.akinsemoyin\Documents\DATA STUDY\SQL\HEXACART MARKET BASKET ANALYSIS\order_products__train.csv")

<h3>Inspect respective dataframes and clean</h3>

1) Aisles

In [3]:
#return the first few rows of the Aisles dataframe
aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [4]:
#drop duplicates
aisles.drop_duplicates(inplace=True)

In [5]:
#Determine the number of null values per column
aisles.isnull().sum()

aisle_id    0
aisle       0
dtype: int64

2) Departments

In [6]:
#Return the first few rows of the Department dataframe
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [7]:
#Determine the number of null values per column
departments.isnull().sum()

department_id    0
department       0
dtype: int64

In [8]:
#drop duplicates
departments.drop_duplicates(inplace=True)

3) Orders

In [9]:
#Return the first few rows of the orders dataframe
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [10]:
#Return a high level summary of the Orders dataframe
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   order_dow               int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
dtypes: float64(1), int64(5), object(1)
memory usage: 182.7+ MB

In [11]:
#Determine the number of null values per column
orders.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [12]:
#change the null values to zero(0) in the days_since_prior_order.
orders.fillna({'days_since_prior_order':0}, inplace=True)

In [13]:
#Convert days_since_prior_order from a float data type to an int datatype
orders['days_since_prior_order'] = orders['days_since_prior_order'].astype(int)

In [14]:
#drop duplicates
orders.drop_duplicates(inplace=True)

4) Products

In [15]:
#Return the first few rows of the products dataframe
products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [16]:
#Return a high level summary of the products dataframe
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49688 entries, 0 to 49687
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49688 non-null  int64
 1   product_name   49688 non-null  object
 2   aisle_id       49688 non-null  int64
 3   department_id  49688 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [17]:
#drop duplicates
products.drop_duplicates(inplace=True)

5) Order products prior

In [18]:
#Return the first few rows of the orders products prior dataframe
order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [19]:
#Return a high level summary of the order products prior dataframe
order_products_prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           int64
 1   product_id         int64
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(4)
memory usage: 989.8 MB

In [20]:
#Determine the number of null values per column
order_products_prior.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

In [21]:
#drop duplicates
order_products_prior.drop_duplicates(inplace=True)

6) Order products train

In [22]:
#Return the first few rows of the orders products train dataframe
order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [23]:
#Return a high level summary of the order products train dataframe
order_products_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1384617 entries, 0 to 1384616
Data columns (total 4 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   order_id           1384617 non-null  int64
 1   product_id         1384617 non-null  int64
 2   add_to_cart_order  1384617 non-null  int64
 3   reordered          1384617 non-null  int64
dtypes: int64(4)
memory usage: 42.3 MB

In [24]:
#Determine the number of null values per column
order_products_train.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

In [25]:
#drop duplicates
order_products_train.drop_duplicates(inplace=True)

<h3>Import datasets into SQL SERVER</h3>

check connection

In [3]:
import pymysql

try:
    connection = pymysql.connect(
        host='127.0.0.1',
        port=3306,
        user='root',
        password='***************',
        database='pandas',
        connect_timeout=10  # Adjust as needed
    )
    print("Connected to MySQL server successfully")

    # Further operations here...

except pymysql.MySQLError as e:
    print("Error connecting to MySQL:", e)

Connected to MySQL server successfully

Format of connection string is:

mysql+pymysql://username:password@host:port/database_name

In [27]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:Akinsemoyin%40%407991@127.0.0.1:3306/instacart', execution_options={"fast_executemany": True})

1) Import aisles dataframe into SQL Server

In [ ]:
aisles.to_sql(
    name='aisles', # database table name
    con=engine,
    if_exists='append',
    index=False
)

2) Import departments dataframe into SQL Server

In [ ]:
departments.to_sql(
    name='departments', # database table name
    con=engine,
    if_exists='append',
    index=False
)

21

3. Import orders dataframe into SQL Server

In [ ]:
orders.shape

(3421083, 7)

<p>When importing a large DataFrame into a MySQL Server, you want to optimize both the efficiency and speed of the import process. We will attempt to chunk the data instead of trying to insert all 3 million rows at once, we can break the DataFrame into smaller chunks and insert them sequentially. This reduces memory overhead and can improve performance.</p>

In [ ]:
# define chunk size
chunk_size = 500000

#iterate over chunks and insert data

for i in range(0, len(orders), chunk_size):
    chunk = orders.iloc[i: i + chunk_size]
    chunk.to_sql(
        name='orders', # database table name
        con=engine,
        if_exists='append',
        index=False,
        method = 'multi',
        chunksize=chunk_size        
    )

4. Import products dataframe into SQL Server

In [ ]:
products.to_sql(
    name='products', # database table name
    con=engine,
    if_exists='append',
    index=False
)

49688

5. Import order products prior dataframe into SQL Server

In [ ]:
order_products_prior.shape

(32434489, 4)

In [ ]:
# define chunk size
chunk_size = 500000

#iterate over chunks and insert data

for i in range(0, len(order_products_prior), chunk_size):
    chunk = order_products_prior.iloc[i: i + chunk_size]
    chunk.to_sql(
        name='order_products_prior', # database table name
        con=engine,
        if_exists='append',
        index=False,
        method = 'multi',
        chunksize=chunk_size        
    )

6. Import order products train dataframe into SQL Server

In [ ]:
order_products_train.shape

(1384617, 4)

In [ ]:
# define chunk size
chunk_size = 500000

#iterate over chunks and insert data

for i in range(0, len(order_products_train), chunk_size):
    chunk = order_products_train.iloc[i: i + chunk_size]
    chunk.to_sql(
        name='order_products_train', # database table name
        con=engine,
        if_exists='append',
        index=False,
        method = 'multi',
        chunksize=chunk_size        
    )

In [ ]:
order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [29]:
re_ordered_counts = order_products_prior.groupby('product_id')['reordered'].sum()
top_10_reordered_products = re_ordered_counts.sort_values(ascending=False).head(10)
top_10_reordered_products_name = pd.merge(top_10_reordered_products,products,on='product_id')
top_10_reordered_products_name[['product_name','reordered']]

             product_name  reordered
0                  Banana     398609
1  Bag of Organic Bananas     315913
2    Organic Strawberries     205845
3    Organic Baby Spinach     186884
4    Organic Hass Avocado     170131
5         Organic Avocado     134044
6      Organic Whole Milk     114510
7             Large Lemon     106255
8     Organic Raspberries     105409
9            Strawberries      99802